charliermarsh.ruff
github.copilot
github.copilot-chat
github.github-vscode-theme
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
usernamehw.errorlens
vscode-icons-team.vscode-icons
